import os
from dotenv import load_dotenv
from langchain_gigachat import GigaChat
from datetime import date

load_dotenv()
credentials = os.getenv("GIGACHAT_CREDENTIALS")
# print(credentials)

# объект большой языковой модели
# через который мы обращаемся с gigachat
llm_model = GigaChat(
    model="GigaChat-2",
    credentials=credentials,
    verify_ssl_certs=False,
)

system_prompt = f""" 
Ты помощник приложения для учёта расходов. 

Сегодня {date.today()}. Если пользователь говорит "сегодня", "в этом месяце" и тд.
Опирайся на эту дату.

Ты можешь получать статистику расходов пользователя по категориям. 
Если пользователь спрашивает о своих расходах: 

1. Определи начальную и конечную дату периода. 
2. Если пользователь указал количество категорий — используй его. 
3. Если количество не указано — используй 3. 
4. Используй подходящий инструмент для получения данных. 
5. После получения данных понятно объясни пользователю результат. 
Работай только с данными которые присылает API и корректно обрабатывай входные данные
Больше ничего не придумывай.
Еще ты можешь получать список транзакций пользователя, 
отсортированный по возрастанию или убыванию
Соответствующая функция есть в твоих инструментах
"""
